glcloud/keil_v5/ARM/PACK/.Web/NXP.MKL03Z4_DFP.pdsc
    <condition id="devices.MKL03Z4_device.MKL03Z4_device.MKL03Z4_startup_device.device_device_driver.clock_driver.common_driver.gpio_driver.lpuart_driver.port_driver.smc_utility_utility.debug_console">
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.I2C_CMSISInclude_device.MKL03Z4_driver.i2c">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Csub="i2c_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MKL03Z4_driver.lpuart">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MKL03Z4_driver.spi">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Csub="spi_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
    </condition>
    <condition id="device.MKL03Z4_utility.debug_console">
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKL03Z4_driver.common">
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKL03Z4_driver.flash">
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
    </condition>
    <condition id="device.MKL03Z4">
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="devices.MKL03Z4_platform.Include_core_cm0plus">
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
    </condition>
    <condition id="devices.MKL03Z16xxx4_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
    </condition>
    <condition id="devices.MKL03Z32xxx4_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
    </condition>
    <condition id="devices.MKL03Z8xxx4_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
    </condition>
    <condition id="devices.MKL03Z16xxx4_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z16???4"/>
    </condition>
    <condition id="devices.MKL03Z32xxx4_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z32???4"/>
    </condition>
    <condition id="devices.MKL03Z8xxx4_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MKL03Z8???4"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
